atsamd-rs/atsamd/svd/PIC32CX1025SG60100.svd
            <register>
               <name>CA0R</name>
               <description>Capabilities 0</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x27E80080</resetValue>
               <fields>
                  <field>
                     <name>TEOCLKF</name>
                     <description>Timeout Clock Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>TEOCLKFSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEOCLKU</name>
                     <description>Timeout Clock Unit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TEOCLKUSelect</name>
                        <enumeratedValue>
                           <name>KHZ</name>
                           <description>KHz</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MHZ</name>
                           <description>MHz</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BASECLKF</name>
                     <description>Base Clock Frequency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>BASECLKFSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXBLKL</name>
                     <description>Max Block Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MAXBLKLSelect</name>
                        <enumeratedValue>
                           <name>512</name>
                           <description>512 bytes</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ED8SUP</name>
                     <description>8-bit Support for Embedded Device</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ED8SUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>8-bit Bus Width not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>8-bit Bus Width Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMA2SUP</name>
                     <description>ADMA2 Support</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ADMA2SUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>ADMA2 not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>ADMA2 Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSSUP</name>
                     <description>High Speed Support</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HSSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>High Speed not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>High Speed Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SDMASUP</name>
                     <description>SDMA Support</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SDMASUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>SDMA not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SDMA Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRSUP</name>
                     <description>Suspend/Resume Support</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Suspend/Resume not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Suspend/Resume Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V33VSUP</name>
                     <description>Voltage Support 3.3V</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>V33VSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>3.3V Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>3.3V Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V30VSUP</name>
                     <description>Voltage Support 3.0V</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>V30VSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>3.0V Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>3.0V Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V18VSUP</name>
                     <description>Voltage Support 1.8V</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>V18VSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>1.8V Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>1.8V Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SB64SUP</name>
                     <description>64-Bit System Bus Support</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SB64SUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>32-bit Address Descriptors and System Bus</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>64-bit Address Descriptors and System Bus</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASINTSUP</name>
                     <description>Asynchronous Interrupt Support</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASINTSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Asynchronous Interrupt not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Asynchronous Interrupt supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLTYPE</name>
                     <description>Slot Type</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SLTYPESelect</name>
                        <enumeratedValue>
                           <name>REMOVABLE</name>
                           <description>Removable Card Slot</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMBEDDED</name>
                           <description>Embedded Slot for One Device</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CA1R</name>
               <description>Capabilities 1</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000070</resetValue>
               <fields>
                  <field>
                     <name>SDR50SUP</name>
                     <description>SDR50 Support</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SDR50SUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>SDR50 is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SDR50 is Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SDR104SUP</name>
                     <description>SDR104 Support</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SDR104SUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>SDR104 is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SDR104 is Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDR50SUP</name>
                     <description>DDR50 Support</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DDR50SUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>DDR50 is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>DDR50 is Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRVASUP</name>
                     <description>Driver Type A Support</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DRVASUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Driver Type A is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Driver Type A is Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRVCSUP</name>
                     <description>Driver Type C Support</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DRVCSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Driver Type C is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Driver Type C is Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRVDSUP</name>
                     <description>Driver Type D Support</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DRVDSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Driver Type D is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Driver Type D is Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCNTRT</name>
                     <description>Timer Count for Re-Tuning</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>TCNTRTSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Re-Tuning Timer disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1S</name>
                           <description>1 second</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2S</name>
                           <description>2 seconds</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4S</name>
                           <description>4 seconds</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8S</name>
                           <description>8 seconds</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16S</name>
                           <description>16 seconds</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32S</name>
                           <description>32 seconds</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64S</name>
                           <description>64 seconds</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>128S</name>
                           <description>128 seconds</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256S</name>
                           <description>256 seconds</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512S</name>
                           <description>512 seconds</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1024S</name>
                           <description>1024 seconds</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information from other source</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSDR50</name>
                     <description>Use Tuning for SDR50</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TSDR50Select</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>SDR50 does not require tuning</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SDR50 requires tuning</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKMULT</name>
                     <description>Clock Multiplier</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>CLKMULTSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Clock Multiplier is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
